Revit 2027 API
ConfigurationReloadInfo.GetConnectivityValidation Method
 Returns information about the post-reload connectivity validation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionValidationInfo GetConnectivityValidation()
Public Function GetConnectivityValidation As ConnectionValidationInfo
public:
ConnectionValidationInfo^ GetConnectivityValidation()
member GetConnectivityValidation : unit -> ConnectionValidationInfo
Return Value
ConnectionValidationInfo
 Information about the post-reload connectivity validation.
See Also
Reference
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace